;; -*- lexical-binding: t; -*-

;; Disabled packages
(package! diredfl      :disable t)
(package! gptel-quick  :disable t)
(package! haml-mode    :disable t)
(package! hl-line      :disable t)
(package! ivy          :disable t)
(package! lsp          :disable t)
(package! nose         :disable t)
(package! org-pdftools :disable t)
(package! org-yt       :disable t)
(package! orgit-forge  :disable t)
(package! pip-requirements :disable t)
(package! pipenv       :disable t)
(package! popwin       :disable t)
(package! powerline    :disable t)
(package! projectile   :disable t)
(package! pyenv        :disable t)
(package! pyenv-mode   :disable t)
(package! pyvenv       :disable t)
(package! swiper       :disable t)
(package! string-inflection :disable t)

(package! corfu :recipe (:host github :repo "minad/corfu"))
(package! cape :recipe (:host github :repo "minad/cape"))
(package! yasnippet-capf :recipe (:host github :repo "elken/yasnippet-capf"))

;; Misc packages
;; start:sort
(package! almost-mono-themes      :pin "0641bf565c113caef8d5c2a93f38cff32ebb62b7" :recipe (:host github :repo "cryon/almost-mono-themes"))
(package! affe                    :pin "374876589535234bda59465f691a645e26c1b898")
(package! apheleia                :pin "f1d36031fc162f541f77d4f6c6c0fd6197aba077")
(package! ascii-art-to-unicode    :pin "fa3d82ddb531855ad7b8ef871871907861327c9f")
(package! backup-each-save        :pin "9d9714be7bf99b2a192587c1454822c69c61915e" :recipe (:host github :repo "andrewpeck/backup-each-save"))
(package! benchmark-init          :pin "6507caa3c4cb2a6c9b85c771c5e9e5aeb7d745bc")
(package! bookmark-url.el         :pin "e11160fcb69ad8676d0ec7a440b71083b4703423" :recipe (:host github :repo "andrewpeck/bookmark-url.el"))
(package! browse-at-remote        :pin "76aa27dfd469fcae75ed7031bb73830831aaccbf" :recipe (:host github :repo "rmuslimov/browse-at-remote"))
(package! buffer-env              :pin "fc5cab4db55f0b95c4b97fbe3104e394da34b91a" :recipe (:host github :repo "astoff/buffer-env"))
(package! casual                  :pin "5e004a06eef3b66865b785bca51512cdb89ff6a9" :recipe (:host github :repo "kickingvegas/casual"))
(package! clojure-emacs           :pin "592c4f89efb5112784cbf94c9ea6fdd045771b62" :recipe (:host github :repo "clojure-emacs/squiggly-clojure"))
(package! code-cells.el           :pin "b99013b81712edbb94fdb57cce083d32ad06fbb8" :recipe (:host github :repo "astoff/code-cells.el"))
(package! comint-scroll-to-bottom :pin "1cd1471cfca72ac62d330630afe2f2fad44abcf5" :recipe (:host github :repo "jorgenschaefer/comint-scroll-to-bottom"))
(package! crontab-mode            :pin "7412f3df0958812bfcacd5875a409fa795fa8ecc")
(package! delight                 :pin "15acb0f0ba400c470e378f9984b315f9e02c1122")
(package! devdocs.el              :pin "d2214d34cdeb4483a594dd6973fcd095cef4653f" :recipe (:host github :repo "astoff/devdocs.el"))
(package! dired-filter            :pin "e9e408e8571aee5574ca0a431ef15cac5a3585d4" :recipe (:host github :repo "Fuco1/dired-hacks"))
(package! dired-git-info          :pin "1bfcdf139181afc9034a40dd0640e53d95b12f5f" :recipe (:host github :repo "tuh8888/dired-git-info"))
(package! dired-preview           :pin "64e3759612c932f59499a455d22fc14d7a7d67bb" :recipe (:host github :repo "protesilaos/dired-preview"))
(package! drag-stuff              :pin "6d06d846cd37c052d79acd0f372c13006aa7e7c8")
(package! dwim-shell-command      :pin "4b077432a94873e5f505c8f569743cfd984eebb1" :recipe (:host github :repo "xenodium/dwim-shell-command"))
(package! eldoc-box               :pin "ebc0e2c13791f5a22cf81be050b32f0ebf726855" :recipe (:host github :repo "casouri/eldoc-box"))
(package! eglot-booster           :pin "cab7803c4f0adc7fff9da6680f90110674bb7a22" :recipe (:host github :repo "jdtsmith/eglot-booster"))
(package! elfeed                  :pin "a39fb78e34ee25dc8baea83376f929d7c128344f" :recipe (:host github :repo "skeeto/elfeed"))
(package! emacs-colorpicker       :pin "3acee0fc0e35e130fb049ab69f99544a1ca9d11f" :recipe (:host github :repo "syohex/emacs-colorpicker"))
(package! emacs-memoize           :pin "51b075935ca7070f62fae1d69fe0ff7d8fa56fdd" :recipe (:host github :repo "skeeto/emacs-memoize"))
(package! emacs-ucf-mode          :pin "6345afdbd373e6738e9c9d93694d4a5fb39e4a13" :recipe (:host github :repo "andrewpeck/emacs-ucf-mode"))
(package! expand-region           :pin "351279272330cae6cecea941b0033a8dd8bcc4e8" :recipe (:host github :repo "magnars/expand-region.el"))
(package! flycheck-clj-kondo      :pin "e38c67ba9db1ea1cbe1b61ab39b506c05efdcdbf" :recipe (:host github :repo "borkdude/flycheck-clj-kondo"))
(package! flycheck-pycheckers     :pin "1bd9b7a7d4009a81ebd34515a72a3a94c313ad76" :recipe (:host github :repo "msherry/flycheck-pycheckers"))
(package! gptel                   :pin "81618f24e2190568ea745dca82ba50267eed321a")
(package! gptel-quick             :pin "495b5e0b5348dbced1448bd12cbf8847e30b5175" :recipe (:host github :repo "karthink/gptel-quick"))
(package! graphviz-dot-mode       :pin "2c7ba85d19cbed4984d0cab31aa33800ffa89f78")
(package! hdl_deps                :pin "6adb437647edc9e17ce1ddf6e88f2571f8945179" :recipe (:host github :repo "andrewpeck/hdl_deps"))
(package! hog-emacs               :pin "893dc124ce3e48f99e995749788f329fa36adc6c" :recipe (:host github :repo "andrewpeck/hog-emacs"))
(package! hydra                   :pin "59a2a45a35027948476d1d7751b0f0215b1e61aa")
(package! logview                 :pin "cd990bf63785897bfdfa0ec954db986f0361449f")
(package! jinx                    :pin "8d9cca951de02ef33c3ef0ed31c0bf62984d3680" :recipe (:host github :repo "minad/jinx"))
(package! lorem-ipsum             :pin "4e87a899868e908a7a9e1812831d76c8d072f885")
(package! lte.el                  :pin "011c86d9fb72d00105293efabef4756274d851b4" :recipe (:host github :repo "fredericgiquel/lte.el"))
(package! magit-todos             :pin "bd27c57eada0fda1cc0a813db04731a9bcc51b7b")
(package! markdown-preview-mode   :pin "68242b3907dc065aa35412bfd928b43d8052d321" :recipe (:host github :repo "ancane/markdown-preview-mode"))
(package! nerd-icons.el           :pin "14f7278dd7eb5eca762a6ff32467c72c661c0aae" :recipe (:host github :repo "rainstormstudio/nerd-icons.el"))
(package! nix-mode                :pin "719feb7868fb567ecfe5578f6119892c771ac5e5" :recipe (:host github :repo "NixOS/nix-mode"))
(package! nyan-mode               :pin "09904af23adb839c6a9c1175349a1fb67f5b4370" :recipe (:host github :repo "TeMPOraL/nyan-mode") )
(package! ob-mermaid              :pin "9cffa17625aab01cb7b0d8ba87691eba5d96e8d3" :recipe (:host github :repo "arnm/ob-mermaid"))
(package! ob-wavedrom             :pin "85b12dba1a5ba2496e6bc377c25ce365fa221fbf" :recipe (:host github :repo "andrewpeck/ob-wavedrom"))
(package! olivetti                :pin "845eb7a95a3ca3325f1120c654d761b91683f598")
(package! org-appear              :pin "32ee50f8fdfa449bbc235617549c1bccb503cb09" :recipe (:host github :repo "awth13/org-appear"))
(package! org-download            :pin "c8be2611786d1d8d666b7b4f73582de1093f25ac" :recipe (:host github :repo "abo-abo/org-download"))
(package! org-excalidraw          :pin "d697540dd0b03256d00d3891307efa66ffd10a21" :recipe (:host github :repo "andrewpeck/org-excalidraw") )
(package! org-web-tools           :pin "7a6498f442fc7f29504745649948635c7165d847")
(package! p-search                :pin "38a66610a094d4026aaf7733148582375387fd99" :recipe (:host github :repo "zkry/p-search"))
(package! plz                     :pin "981a4d09521ef59439713624702efcad996840a0")
(package! poporg                  :pin "2c58d68c81ecca4140bf179f19ed153ec804b65a" :recipe (:host github :repo "QBobWatson/poporg"))
(package! rainbow-delimiters      :pin "f40ece58df8b2f0fb6c8576b527755a552a5e763")
(package! rainbow-mode            :pin "2e6b18609c2fdd1a2dc513937a64d276fd6cf24c")
(package! scad-mode               :pin "1f5a2dd4d602aca0f4ceb3230f8d11107a9187fe")
(package! screenshot              :pin "2770c0cfefe1cc09d55585f4f2f336a1b26e610e" :recipe (:host github :repo "tecosaur/screenshot"))
(package! standard-themes         :pin "bf3a0a48443118dbb95596b987c22a5a5796685f" :recipe (:host github :repo "protesilaos/standard-themes"))
(package! svg-tag-mode            :pin "13e888b8bd9a0664d060149a44a751b2113331b6" :recipe (:host github :repo "rougier/svg-tag-mode"))
(package! system-install.el       :pin "b9ce1426f76d0deaff455b486a6b66516cb9adb3" :recipe (:host github :repo "andrewpeck/system-install.el"))
(package! systemd                 :pin "8742607120fbc440821acbc351fda1e8e68a8806" :recipe (:host github :repo "holomorph/systemd-mode"))
(package! toc-org                 :pin "6d3ae0fc47ce79b1ea06cabe21a3c596395409cd")
(package! uniline                 :pin "ad2c970cb1b5fcfca477b74ece597ca674d31f4f" :recipe (:host github :repo "tbanel/uniline"))
(package! verilog-mode            :pin "50702561784f7cc6b52b8f0c12d904a4db994d29" :recipe (:host github :repo "veripool/verilog-mode"))
(package! verilog-port-copy       :pin "b83145b1106d12d0d258cb44c2ed39126be0dca1" :recipe (:host github :repo "andrewpeck/verilog-port-copy"))
(package! vim-tab-bar.el          :pin "d5bd8624320e2311b8feb40971488e29cdf7f57f" :recipe (:host github :repo "jamescherti/vim-tab-bar.el"))
(package! vimrc-mode              :pin "f594392a0834193a1fe1522d007e1c8ce5b68e43")
(package! visual-fill-column      :pin "30fc3e4ea9aa415eccc873e5d7c4f1bbc0491495" :recipe (:host codeberg :repo "joostkremers/visual-fill-column"))
(package! vivado_mode             :pin "d0192c2919855bbc96f269f75b49a5a95242eeb1" :recipe (:host github :repo "andrewpeck/vivado_mode"))
(package! wavedrom-mode           :pin "249aec11fdab12ae6228c2bc2580b581d16e3443" :recipe (:host github :repo "gmlarumbe/wavedrom-mode"))
(package! xr                      :pin "cbcb51d5ba2a28c47264ddd17ac4ff0c89b0451e")                           ; xr is rx in reverse
;; end:sort

;; (package! treesit-auto            :pin "016bd286a1ba4628f833a626f8b9d497882ecdf3" :recipe (:host github :repo "renzmann/treesit-auto"))
;; (package! org-mode                :pin "5cfc857c66e3ad7d4b70bb4a61f641c059994170" :recipe (:host github :repo "emacs-straight/org-mode"))
;; (package! headlice                :pin "c659acd65d0d52a68c58fa3cda307018144839e1" :recipe (:host nil :repo "https://code.tecosaur.net/tec/headlice"))
;; (package! cdlatex                 :pin "fac070f0164ac9f5859cb4cccba7d29a65c337f3" :recipe (:host github :repo "cdominik/cdlatex"))
;; (package! lazytab                 :pin "a6eafad3cd796a662a59dcb3e0ada8175e9fa216" :recipe (:host github :repo "karthink/lazytab"))
;; (package! verilog-ext             :pin "d504f59eac2fa04f1d627d7acab639f79a2356fe" :recipe (:host github :repo "gmlarumbe/verilog-ext"))
;; (package! tabular :recipe (:host github :repo "andrewpeck/tabular"))
;; (package! org-modern            :pin "240026f0bef6dabff1e86ab092a678beddd301c3" :recipe (:host github :repo "minad/org-modern"))
;; (package! verilog-ext :recipe (:host github :repo "gmlarumbe/verilog-ext")) ;; brings in too many dependencies... ag aphelia lsp outorg outshine rg :(

;; Local Variables:
;; eval: (make-variable-buffer-local 'kill-buffer-hook)
;; eval: (add-hook 'kill-buffer-hook (lambda () (sort-elisp-block) (save-buffer)) nil t)
;; End:
