;;; packages.el -*- lexical-binding: t; no-byte-compile: t; -*-

;; Disabled packages
(package! diredfl      :disable t)
(package! gptel-quick  :disable t)
(package! haml-mode    :disable t)
(package! hl-line      :disable t)
(package! ivy          :disable t)
(package! avy          :disable t)
(package! lsp          :disable t)
(package! nose         :disable t)
(package! org-pdftools :disable t)
(package! org-yt       :disable t)
(package! orgit-forge  :disable t)
(package! pip-requirements :disable t)
(package! pipenv       :disable t)
(package! popwin       :disable t)
(package! powerline    :disable t)
(package! projectile   :disable t)
(package! pyenv        :disable t)
(package! pyenv-mode   :disable t)
(package! pyvenv       :disable t)
(package! swiper       :disable t)
(package! string-inflection :disable t)

(package! corfu :recipe (:host github :repo "minad/corfu"))
(package! cape :recipe (:host github :repo "minad/cape"))
(package! yasnippet-capf :recipe (:host github :repo "elken/yasnippet-capf"))

;; Misc packages
;; start:sort
(package! adaptive-wrap           :pin "d75665b9c88e65f91dadd1e5880905bbdb7c09b7")
(package! affe                    :pin "10fc401cf2d35bafb7220b9456af7dbfd064e1f2")
(package! almost-mono-themes      :pin "0641bf565c113caef8d5c2a93f38cff32ebb62b7" :recipe (:host github :repo "cryon/almost-mono-themes"))
(package! apheleia                :pin "f1d36031fc162f541f77d4f6c6c0fd6197aba077")
(package! ascii-art-to-unicode    :pin "fa3d82ddb531855ad7b8ef871871907861327c9f")
(package! backup-each-save        :pin "9d9714be7bf99b2a192587c1454822c69c61915e" :recipe (:host github :repo "andrewpeck/backup-each-save"))
(package! benchmark-init          :pin "6507caa3c4cb2a6c9b85c771c5e9e5aeb7d745bc")
(package! bookmark-url.el         :pin "e11160fcb69ad8676d0ec7a440b71083b4703423" :recipe (:host github :repo "andrewpeck/bookmark-url.el"))
(package! browse-at-remote        :pin "cf0269f3db9e968c819b1d85b33d791c20c2e495" :recipe (:host github :repo "rmuslimov/browse-at-remote"))
(package! buffer-env              :pin "fc5cab4db55f0b95c4b97fbe3104e394da34b91a" :recipe (:host github :repo "astoff/buffer-env"))
(package! casual                  :pin "0c0a386bb9e73532679a29a270cfdd2c6e386d66" :recipe (:host github :repo "kickingvegas/casual"))
(package! clojure-emacs           :pin "592c4f89efb5112784cbf94c9ea6fdd045771b62" :recipe (:host github :repo "clojure-emacs/squiggly-clojure"))
(package! code-cells.el           :pin "b99013b81712edbb94fdb57cce083d32ad06fbb8" :recipe (:host github :repo "astoff/code-cells.el"))
(package! comint-scroll-to-bottom :pin "1cd1471cfca72ac62d330630afe2f2fad44abcf5" :recipe (:host github :repo "jorgenschaefer/comint-scroll-to-bottom"))
(package! crontab-mode            :pin "7412f3df0958812bfcacd5875a409fa795fa8ecc")
(package! delight                 :pin "15acb0f0ba400c470e378f9984b315f9e02c1122")
(package! devdocs.el              :pin "25c746024ddf73570195bf42b841f761a2fee10c" :recipe (:host github :repo "astoff/devdocs.el"))
(package! dired-filter            :pin "de9336f4b47ef901799fe95315fa080fa6d77b48" :recipe (:host github :repo "Fuco1/dired-hacks"))
(package! dired-git-info          :pin "1bfcdf139181afc9034a40dd0640e53d95b12f5f" :recipe (:host github :repo "tuh8888/dired-git-info"))
(package! dired-preview           :pin "3e3780a3becb53009593cb3dbfbef987ea286a2f" :recipe (:host github :repo "protesilaos/dired-preview"))
(package! drag-stuff              :pin "6d06d846cd37c052d79acd0f372c13006aa7e7c8")
(package! dwim-shell-command      :pin "5ffad4ac5702e046166d0f59a3d3d790aa8274a2" :recipe (:host github :repo "xenodium/dwim-shell-command"))
(package! eglot                   :pin "ad7e201bb6d892895b07048f809fe336f6935109" :recipe (:host github :repo "joaotavora/eglot"))
(package! eglot-booster           :pin "cab7803c4f0adc7fff9da6680f90110674bb7a22" :recipe (:host github :repo "jdtsmith/eglot-booster"))
(package! elfeed                  :pin "a39fb78e34ee25dc8baea83376f929d7c128344f" :recipe (:host github :repo "skeeto/elfeed"))
(package! emacs-colorpicker       :pin "3acee0fc0e35e130fb049ab69f99544a1ca9d11f" :recipe (:host github :repo "syohex/emacs-colorpicker"))
(package! emacs-memoize           :pin "51b075935ca7070f62fae1d69fe0ff7d8fa56fdd" :recipe (:host github :repo "skeeto/emacs-memoize"))
(package! emacs-ucf-mode          :pin "6345afdbd373e6738e9c9d93694d4a5fb39e4a13" :recipe (:host github :repo "andrewpeck/emacs-ucf-mode"))
(package! expand-region           :pin "351279272330cae6cecea941b0033a8dd8bcc4e8" :recipe (:host github :repo "magnars/expand-region.el"))
(package! flycheck-clj-kondo      :pin "e38c67ba9db1ea1cbe1b61ab39b506c05efdcdbf" :recipe (:host github :repo "borkdude/flycheck-clj-kondo"))
(package! flycheck-pycheckers     :pin "1bd9b7a7d4009a81ebd34515a72a3a94c313ad76" :recipe (:host github :repo "msherry/flycheck-pycheckers"))
(package! gptel                   :pin "13baa6754e7b12ce9f0a5a87bf11cf01d1b753d8")
(package! gptel-quick             :pin "495b5e0b5348dbced1448bd12cbf8847e30b5175" :recipe (:host github :repo "karthink/gptel-quick"))
(package! graphviz-dot-mode       :pin "516c151b845a3eb2da73eb4ee648ad99172087ac")
(package! hdl_deps                :pin "6adb437647edc9e17ce1ddf6e88f2571f8945179" :recipe (:host github :repo "andrewpeck/hdl_deps"))
(package! hog-emacs               :pin "893dc124ce3e48f99e995749788f329fa36adc6c" :recipe (:host github :repo "andrewpeck/hog-emacs"))
(package! hydra                   :pin "59a2a45a35027948476d1d7751b0f0215b1e61aa")
(package! jinx                    :pin "e0ad6ea90e25c363a419eb5dbc378ae82252ed0a" :recipe (:host github :repo "minad/jinx"))
(package! logview                 :pin "649d878f7e2aad0f938b2cf0a870f1968b4d5e30")
(package! lorem-ipsum             :pin "4e87a899868e908a7a9e1812831d76c8d072f885")
(package! lte.el                  :pin "011c86d9fb72d00105293efabef4756274d851b4" :recipe (:host github :repo "fredericgiquel/lte.el"))
(package! magit-todos             :pin "7294a95580bddf7232f2d205efae312dc24c5f61")
(package! markdown-preview-mode   :pin "68242b3907dc065aa35412bfd928b43d8052d321" :recipe (:host github :repo "ancane/markdown-preview-mode"))
(package! nerd-icons.el           :pin "418f137faac926b822582fbce55a74a26e891ec5" :recipe (:host github :repo "rainstormstudio/nerd-icons.el"))
(package! nix-mode                :pin "719feb7868fb567ecfe5578f6119892c771ac5e5" :recipe (:host github :repo "NixOS/nix-mode"))
(package! nyan-mode               :pin "09904af23adb839c6a9c1175349a1fb67f5b4370" :recipe (:host github :repo "TeMPOraL/nyan-mode") )
(package! ob-mermaid              :pin "372c2d91d3cdba5da9f7ac23e7bce7a0b3b46862" :recipe (:host github :repo "arnm/ob-mermaid"))
(package! ob-wavedrom             :pin "85b12dba1a5ba2496e6bc377c25ce365fa221fbf" :recipe (:host github :repo "andrewpeck/ob-wavedrom"))
(package! org-appear              :pin "32ee50f8fdfa449bbc235617549c1bccb503cb09" :recipe (:host github :repo "awth13/org-appear"))
(package! org-download            :pin "c8be2611786d1d8d666b7b4f73582de1093f25ac" :recipe (:host github :repo "abo-abo/org-download"))
(package! org-excalidraw          :pin "d697540dd0b03256d00d3891307efa66ffd10a21" :recipe (:host github :repo "andrewpeck/org-excalidraw") )
(package! org-web-tools           :pin "7a6498f442fc7f29504745649948635c7165d847")
(package! p-search                :pin "c382c80947a95825e258332d6f89bd6be496d914" :recipe (:host github :repo "zkry/p-search"))
(package! plz                     :pin "981a4d09521ef59439713624702efcad996840a0")
(package! poporg                  :pin "2c58d68c81ecca4140bf179f19ed153ec804b65a" :recipe (:host github :repo "QBobWatson/poporg"))
(package! rainbow-delimiters      :pin "f40ece58df8b2f0fb6c8576b527755a552a5e763")
(package! rainbow-mode            :pin "2e6b18609c2fdd1a2dc513937a64d276fd6cf24c")
(package! resume.el               :pin "f451785aae168ea4505846e38381e56f910076cc" :recipe (:host github :repo "andrewpeck/resume.el"))
(package! scad-mode               :pin "b130730a3123387e69c85cf10633701ea447fa2a")
(package! screenshot              :pin "2770c0cfefe1cc09d55585f4f2f336a1b26e610e" :recipe (:host github :repo "tecosaur/screenshot"))
(package! standard-themes         :pin "a341ec1ef416bcadc90b1a49e2163a51c401f8d8" :recipe (:host github :repo "protesilaos/standard-themes"))
(package! svg-tag-mode            :pin "13e888b8bd9a0664d060149a44a751b2113331b6" :recipe (:host github :repo "rougier/svg-tag-mode"))
(package! system-install.el       :pin "80951d1eab707bb0aede77263726ca6209eaf21a" :recipe (:host github :repo "andrewpeck/system-install.el"))
(package! systemd                 :pin "8742607120fbc440821acbc351fda1e8e68a8806" :recipe (:host github :repo "holomorph/systemd-mode"))
(package! toc-org                 :pin "6d3ae0fc47ce79b1ea06cabe21a3c596395409cd")
(package! uniline                 :pin "cc53c929af7b52e38afdc793321e87049ccb043c" :recipe (:host github :repo "tbanel/uniline"))
(package! verilog-mode            :pin "2be535c1eb276fc449e8c89357b37d691112b3f8" :recipe (:host github :repo "veripool/verilog-mode"))
(package! verilog-port-copy       :pin "b83145b1106d12d0d258cb44c2ed39126be0dca1" :recipe (:host github :repo "andrewpeck/verilog-port-copy"))
(package! vim-tab-bar.el          :pin "534c0a42e40e867e144efbaa55b1ebc116ed0c60" :recipe (:host github :repo "jamescherti/vim-tab-bar.el"))
(package! vimrc-mode              :pin "f594392a0834193a1fe1522d007e1c8ce5b68e43")
(package! visual-fill-column      :pin "aeca29f8ce16b21dce9a989461e7fa445f6ecfd5" :recipe (:host codeberg :repo "joostkremers/visual-fill-column"))
(package! vivado_mode             :pin "d0192c2919855bbc96f269f75b49a5a95242eeb1" :recipe (:host github :repo "andrewpeck/vivado_mode"))
(package! wavedrom-mode           :pin "43e4fb89b35e5c899d08b01efa310ddf482e6f4e" :recipe (:host github :repo "gmlarumbe/wavedrom-mode"))
(package! xr                      :pin "4088798ad47d0d57cd67a8129a101645978ab1bd")                           ; xr is rx in reverse
;; end:sort

(package! string-edit-at-point    :pin "87936d816ae24184dd83688136531b6b6f1943fe" :recipe (:host github :repo "emacsmirror/string-edit-at-point"))
;; (package! treesit-auto            :pin "016bd286a1ba4628f833a626f8b9d497882ecdf3" :recipe (:host github :repo "renzmann/treesit-auto"))
;; (package! org-mode                :pin "5cfc857c66e3ad7d4b70bb4a61f641c059994170" :recipe (:host github :repo "emacs-straight/org-mode"))
;; (package! headlice                :pin "c659acd65d0d52a68c58fa3cda307018144839e1" :recipe (:host nil :repo "https://code.tecosaur.net/tec/headlice"))
;; (package! cdlatex                 :pin "fac070f0164ac9f5859cb4cccba7d29a65c337f3" :recipe (:host github :repo "cdominik/cdlatex"))
;; (package! lazytab                 :pin "a6eafad3cd796a662a59dcb3e0ada8175e9fa216" :recipe (:host github :repo "karthink/lazytab"))
;; (package! verilog-ext             :pin "d504f59eac2fa04f1d627d7acab639f79a2356fe" :recipe (:host github :repo "gmlarumbe/verilog-ext"))
;; (package! tabular :recipe (:host github :repo "andrewpeck/tabular"))
;; (package! org-modern            :pin "240026f0bef6dabff1e86ab092a678beddd301c3" :recipe (:host github :repo "minad/org-modern"))
;; (package! verilog-ext :recipe (:host github :repo "gmlarumbe/verilog-ext")) ;; brings in too many dependencies... ag aphelia lsp outorg outshine rg :(

;; Local Variables:
;; eval: (make-variable-buffer-local 'kill-buffer-hook)
;; eval: (add-hook 'kill-buffer-hook (lambda () (sort-elisp-block) (save-buffer)) nil t)
;; End:
