;;; packages.el -*- lexical-binding: t; no-byte-compile: t; -*-

(package! psi-emacs  :type 'local :recipe (:local-repo "~/work/psi-emacs" :type git) )

;; Disabled packages
(package! diredfl      :disable t)
(package! gptel-quick  :disable t)
(package! haml-mode    :disable t)
(package! hl-line      :disable t)
(package! ivy          :disable t)
(package! avy          :disable t)
(package! lsp          :disable t)
(package! nose         :disable t)
(package! org-pdftools :disable t)
(package! org-yt       :disable t)
(package! orgit-forge  :disable t)
(package! pip-requirements :disable t)
(package! pipenv       :disable t)
(package! popwin       :disable t)
(package! powerline    :disable t)
(package! projectile   :disable t)
(package! pyenv        :disable t)
(package! pyenv-mode   :disable t)
(package! pyvenv       :disable t)
(package! swiper       :disable t)
(package! string-inflection :disable t)

(package! corfu :recipe (:host github :repo "minad/corfu"))
(package! cape :recipe (:host github :repo "minad/cape"))
(package! yasnippet-capf :recipe (:host github :repo "elken/yasnippet-capf"))

;; start:sort
(package! backup-each-save        :pin "3d5f080d6ca24b30de868816d486693140b00426" :recipe (:host github :repo "andrewpeck/backup-each-save"))
(package! bookmark-url.el         :pin "c5081e35c3d1f746ef8754ff8378dc27052fa907" :recipe (:host github :repo "andrewpeck/bookmark-url.el"))
(package! buffer-flip.el          :pin "ace8d64583896fd3c4c97de7a20e4428b6966f2c" :recipe (:host github :repo "andrewpeck/buffer-flip.el"))
(package! cloc.el                 :pin "6eaf53efb1dac2ba2773ec3acb74eeaf2fec0a67" :recipe (:host github :repo "andrewpeck/cloc.el"))
(package! emacs-ucf-mode          :pin "6345afdbd373e6738e9c9d93694d4a5fb39e4a13" :recipe (:host github :repo "andrewpeck/emacs-ucf-mode"))
(package! hdldep                  :pin "dba34acc7bc9661dbf081d639a37076507fcb434" :recipe (:host github :repo "andrewpeck/hdldep.el"))
(package! hog                     :pin "7ab0148a2e9dfdaf60cc834ee261d7d04248176c" :recipe (:host github :repo "andrewpeck/hog.el"))
(package! line-fill-paragraph.el  :pin "0e1342a52d71e5723023814c43f6059a2ffd3da9" :recipe (:host github :repo "andrewpeck/line-fill-paragraph.el"))
(package! ob-wavedrom             :pin "85b12dba1a5ba2496e6bc377c25ce365fa221fbf" :recipe (:host github :repo "andrewpeck/ob-wavedrom"))
(package! org-excalidraw          :pin "0e5365ce2237fd684b20a8b95a4967d850e20333" :recipe (:host github :repo "andrewpeck/org-excalidraw") )
(package! python-string-toggle.el :pin "4bedf8f4f9444e9177a204691778a2a2a89659f0" :recipe (:host github :repo "andrewpeck/python-string-toggle.el"))
(package! resume                  :pin "062dc93dcc5200bf92fcf49507666845b80dc09c" :recipe (:host github :repo "andrewpeck/resume.el"))
(package! system-install          :pin "399c5025c11fdd9b952340e4acd27fd3a2ed4be5" :recipe (:host github :repo "andrewpeck/system-install.el"))
(package! timesheet               :pin "211adb46f139333294640cb53661c8d92925c257" :recipe (:host github :repo "andrewpeck/timesheet.el"))
(package! verilog-port-copy       :pin "7f539be86461ae382d71099a99a2b7691d4d2b3a" :recipe (:host github :repo "andrewpeck/verilog-port-copy"))
(package! verilog-ts-mode         :pin "73a62f3d3e4fc819e11039d3ccdd3b1f3efad263" :recipe (:host github :repo "andrewpeck/verilog-ts-mode"))
(package! vivado_mode             :pin "83b636936107da4cbe1783f2b850ba91c2d1af36" :recipe (:host github :repo "andrewpeck/vivado_mode"))
;; end:sort

;; Misc packages
;; start:sort
(package! adaptive-wrap           :pin "d75665b9c88e65f91dadd1e5880905bbdb7c09b7")
(package! affe                    :pin "295e2fb26a2de66e13c0f8414d1ada5b090a1011")
(package! almost-mono-themes      :pin "6826f1b880bd91170dded26bb420dd4ef164f127" :recipe (:host github :repo "cryon/almost-mono-themes"))
(package! apheleia                :pin "e6e5d5523d229735ab5f8ec83e10beefcfd00d76")
(package! ascii-art-to-unicode    :pin "fa3d82ddb531855ad7b8ef871871907861327c9f")
(package! benchmark-init          :pin "54b9703389f25012e4cc20fe4a0d4ea253ce4820")
(package! browse-at-remote        :pin "38e5ffd77493c17c821fd88f938dbf42705a5158" :recipe (:host github :repo "rmuslimov/browse-at-remote"))
(package! buffer-env              :pin "fc5cab4db55f0b95c4b97fbe3104e394da34b91a" :recipe (:host github :repo "astoff/buffer-env"))
(package! casual                  :pin "0b04ad703efad2a53a3c756c02784e819d0f8b4e" :recipe (:host github :repo "kickingvegas/casual"))
(package! clojure-emacs           :pin "592c4f89efb5112784cbf94c9ea6fdd045771b62" :recipe (:host github :repo "clojure-emacs/squiggly-clojure"))
(package! code-cells.el           :pin "b99013b81712edbb94fdb57cce083d32ad06fbb8" :recipe (:host github :repo "astoff/code-cells.el"))
(package! comint-scroll-to-bottom :pin "1cd1471cfca72ac62d330630afe2f2fad44abcf5" :recipe (:host github :repo "jorgenschaefer/comint-scroll-to-bottom"))
(package! crontab-mode            :pin "7412f3df0958812bfcacd5875a409fa795fa8ecc")
(package! csv-mode                :pin "1695ee17521d55dbe94caacaef5a94dfa933cd9f")
(package! delight                 :pin "15acb0f0ba400c470e378f9984b315f9e02c1122")
(package! devdocs.el              :pin "25c746024ddf73570195bf42b841f761a2fee10c" :recipe (:host github :repo "astoff/devdocs.el"))
(package! dired-filter            :pin "de9336f4b47ef901799fe95315fa080fa6d77b48" :recipe (:host github :repo "Fuco1/dired-hacks"))
(package! dired-git-info          :pin "1bfcdf139181afc9034a40dd0640e53d95b12f5f" :recipe (:host github :repo "tuh8888/dired-git-info"))
(package! dired-preview           :pin "b0cba0825d2eea2ac6d9a8ef65a73b6186e6d294" :recipe (:host github :repo "protesilaos/dired-preview"))
(package! drag-stuff              :pin "6d06d846cd37c052d79acd0f372c13006aa7e7c8")
(package! dwim-shell-command      :pin "eb86e3fbd2c775345fdc018ece27138a779730f5" :recipe (:host github :repo "xenodium/dwim-shell-command"))
(package! ef-themes               :pin "877554112c7fc8afb35f1d1c59827e5f3cba7c5e" :recipe (:host github :repo "protesilaos/ef-themes"))
(package! elfeed                  :pin "bbb3cac27b0412d80b327b5cfaab83683c96a2a1" :recipe (:host github :repo "skeeto/elfeed"))
(package! emacs-colorpicker       :pin "3acee0fc0e35e130fb049ab69f99544a1ca9d11f" :recipe (:host github :repo "syohex/emacs-colorpicker"))
(package! emacs-memoize           :pin "51b075935ca7070f62fae1d69fe0ff7d8fa56fdd" :recipe (:host github :repo "skeeto/emacs-memoize"))
(package! emacs-tramp-rpc         :pin "e60a356c1f7180121c49c8bd18a08370ccfbe49d" :recipe (:host github :repo "ArthurHeymans/emacs-tramp-rpc"))
(package! expand-region           :pin "351279272330cae6cecea941b0033a8dd8bcc4e8" :recipe (:host github :repo "magnars/expand-region.el"))
(package! flycheck-clj-kondo      :pin "e38c67ba9db1ea1cbe1b61ab39b506c05efdcdbf" :recipe (:host github :repo "borkdude/flycheck-clj-kondo"))
(package! gptel                   :pin "bbfbd711fae64b079f7057d71772805edeb00a3d")
(package! gptel-quick             :pin "018ff2be8f860a1e8fe3966eec418ad635620c38" :recipe (:host github :repo "karthink/gptel-quick"))
(package! graphviz-dot-mode       :pin "516c151b845a3eb2da73eb4ee648ad99172087ac")
(package! gruber-darker-theme     :pin "2e9f99c41fe8ef0557e9ea0f3b94ef50c68b5557" :recipe (:host github :repo "rexim/gruber-darker-theme"))
(package! hydra                   :pin "59a2a45a35027948476d1d7751b0f0215b1e61aa")
(package! jinx                    :pin "61bed3f77d37ae02100e8a2ec1cfb849d649fa5d" :recipe (:host github :repo "minad/jinx"))
(package! logview                 :pin "50cac3f726abd4e7872b8fa36ede72550ce66a64")
(package! lorem-ipsum             :pin "4e87a899868e908a7a9e1812831d76c8d072f885")
(package! lte.el                  :pin "011c86d9fb72d00105293efabef4756274d851b4" :recipe (:host github :repo "fredericgiquel/lte.el"))
(package! magit-todos             :pin "7294a95580bddf7232f2d205efae312dc24c5f61")
(package! markdown-preview-mode   :pin "68242b3907dc065aa35412bfd928b43d8052d321" :recipe (:host github :repo "ancane/markdown-preview-mode"))
(package! msgpack.el              :pin "90e3086f259549b1667a3c5b9aa2d70aaeaa4d3d" :recipe (:host github :repo "xuchunyang/msgpack.el")) ; required by
(package! nerd-icons.el           :pin "9a7f44db9a53567f04603bc88d05402cad49c64c" :recipe (:host github :repo "rainstormstudio/nerd-icons.el"))
(package! nix-mode                :pin "719feb7868fb567ecfe5578f6119892c771ac5e5" :recipe (:host github :repo "NixOS/nix-mode"))
(package! nyan-mode               :pin "09904af23adb839c6a9c1175349a1fb67f5b4370" :recipe (:host github :repo "TeMPOraL/nyan-mode") )
(package! ob-mermaid              :pin "4f814ad5e1b96764af52d53799288ff3acc94b47" :recipe (:host github :repo "arnm/ob-mermaid"))
(package! org-appear              :pin "32ee50f8fdfa449bbc235617549c1bccb503cb09" :recipe (:host github :repo "awth13/org-appear"))
(package! org-download            :pin "c8be2611786d1d8d666b7b4f73582de1093f25ac" :recipe (:host github :repo "abo-abo/org-download"))
(package! org-web-tools           :pin "7a6498f442fc7f29504745649948635c7165d847")
(package! p-search                :pin "c382c80947a95825e258332d6f89bd6be496d914" :recipe (:host github :repo "zkry/p-search"))
(package! plz                     :pin "981a4d09521ef59439713624702efcad996840a0")
(package! poporg                  :pin "2c58d68c81ecca4140bf179f19ed153ec804b65a" :recipe (:host github :repo "QBobWatson/poporg"))
(package! rainbow-delimiters      :pin "f40ece58df8b2f0fb6c8576b527755a552a5e763")
(package! rainbow-mode            :pin "2e6b18609c2fdd1a2dc513937a64d276fd6cf24c")
(package! scad-mode               :pin "546d1507cd131f55ca930de7ae1518884e8221f4")
(package! screenshot              :pin "2770c0cfefe1cc09d55585f4f2f336a1b26e610e" :recipe (:host github :repo "tecosaur/screenshot"))
(package! standard-themes         :pin "8c24caa42b369077ccb7b2c0111084fb2153d5a4" :recipe (:host github :repo "protesilaos/standard-themes"))
(package! string-edit-at-point    :pin "87936d816ae24184dd83688136531b6b6f1943fe" :recipe (:host github :repo "emacsmirror/string-edit-at-point"))
(package! svg-tag-mode            :pin "13e888b8bd9a0664d060149a44a751b2113331b6" :recipe (:host github :repo "rougier/svg-tag-mode"))
(package! systemd                 :pin "8742607120fbc440821acbc351fda1e8e68a8806" :recipe (:host github :repo "holomorph/systemd-mode"))
(package! toc-org                 :pin "6d3ae0fc47ce79b1ea06cabe21a3c596395409cd")
(package! uniline                 :pin "2916cabe8e9c588a612fd896d0be4611bd1ad4e8" :recipe (:host github :repo "tbanel/uniline"))
(package! verilog-mode            :pin "54a0c9b5025aa73f585fc18560d724a60ca2e86c" :recipe (:host github :repo "veripool/verilog-mode"))
(package! vim-tab-bar.el          :pin "3ab286ffc3ce5e4215d9d7f502a6982111e49207" :recipe (:host github :repo "jamescherti/vim-tab-bar.el"))
(package! vimrc-mode              :pin "f594392a0834193a1fe1522d007e1c8ce5b68e43")
(package! visual-fill-column      :pin "e1be9a1545157d24454d950c0ac79553c540edb7" :recipe (:host codeberg :repo "joostkremers/visual-fill-column"))
(package! wavedrom-mode           :pin "43e4fb89b35e5c899d08b01efa310ddf482e6f4e" :recipe (:host github :repo "gmlarumbe/wavedrom-mode"))
(package! xr                      :pin "07369f3ceeda919b06d2356d66bfbcbf8975d09d")                           ; xr is rx in reverse
;; end:sort

;; (package! tramp-hlo               :pin "b726b4042e96ac5cead396c8d12c01e6bad2bd78" :recipe (:host github :repo "jsadusk/tramp-hlo"))
;; (package! eglot                   :pin "ad7e201bb6d892895b07048f809fe336f6935109" :recipe (:host github :repo "joaotavora/eglot"))
;; (package! eglot-booster           :pin "cab7803c4f0adc7fff9da6680f90110674bb7a22" :recipe (:host github :repo "jdtsmith/eglot-booster"))
;; (package! treesit-auto            :pin "016bd286a1ba4628f833a626f8b9d497882ecdf3" :recipe (:host github :repo "renzmann/treesit-auto"))
;; (package! headlice                :pin "c659acd65d0d52a68c58fa3cda307018144839e1" :recipe (:host nil :repo "https://code.tecosaur.net/tec/headlice"))
;; (package! cdlatex                 :pin "fac070f0164ac9f5859cb4cccba7d29a65c337f3" :recipe (:host github :repo "cdominik/cdlatex"))
;; (package! lazytab                 :pin "a6eafad3cd796a662a59dcb3e0ada8175e9fa216" :recipe (:host github :repo "karthink/lazytab"))
;; (package! verilog-ext             :pin "d504f59eac2fa04f1d627d7acab639f79a2356fe" :recipe (:host github :repo "gmlarumbe/verilog-ext"))
;; (package! tabular :recipe (:host github :repo "andrewpeck/tabular"))
;; (package! org-modern            :pin "240026f0bef6dabff1e86ab092a678beddd301c3" :recipe (:host github :repo "minad/org-modern"))
;; (package! verilog-ext :recipe (:host github :repo "gmlarumbe/verilog-ext")) ;; brings in too many dependencies... ag aphelia lsp outorg outshine rg :(

;; Local Variables:
;; eval: (make-variable-buffer-local 'kill-buffer-hook)
;; eval: (add-hook 'kill-buffer-hook (lambda () (sort-elisp-block) (save-buffer)) nil t)
;; End:
